20240120133531-hiding_variables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hiding Variables</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hiding Variables</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb1bf772">1. Hiding Variables</a>
<ul>
<li><a href="#org00ccaeb">1.1. Example</a>
<ul>
<li><a href="#orgaea28bd">1.1.1. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1bf772" class="outline-2">
<h2 id="orgb1bf772"><span class="section-number-2">1.</span> Hiding Variables</h2>
<div class="outline-text-2" id="text-1">
<p>
Java <b>doesn’t</b> allow variables to be <a href="20240120133450-overriding_a_method.html#ID-c67b24a4-82f7-4423-83a9-75fc1c566166">overriden</a>.
</p>

<p>
Variables can be <a href="20240120140846-hidden_variable.html#ID-f294b0be-3fad-4ea8-8d51-963401914b09">hidden</a>, though.
</p>

<p>
This creates <b>two</b> distinct copies of the variable within an instance of the <code>child</code> class:
</p>
<ul class="org-ul">
<li>one instance defined in the <code>parent</code> class.</li>
<li>one defined in the <code>child</code> class.</li>
</ul>

<p>
As when hiding a <a href="20240120133516-hiding_static_methods.html#ID-19ea09af-1aa5-4247-b608-13333950e8c0">static Method</a>, you can’t override a variable; you can only <b>hide</b> it.
</p>

<p>
Let’s take a look at a hidden variable:
</p>
</div>

<div id="outline-container-org00ccaeb" class="outline-3">
<h3 id="org00ccaeb"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">class Carnivore {
    protected boolean hasFur = false;
}
public class Meerkat extends Carnivore {
    protected boolean hasFur = true;
}
public static void main(String[] args) {
    Meerkat m = new Meerkat();
    Carnivore c = m;
    System.out.println(m.hasFur); // true
    System.out.println(c.hasFur); // false
}
</pre>
</div>

<p>
(above) Both of these <code>classes</code> define a <code>hasFur</code> variable, but with different values.
</p>

<p>
Even though only <b>one</b> object is created by the <code>main()</code> method, both variables exist <b>independently of each other</b>.
</p>

<p>
The output changes depending on the reference variable used.
</p>
</div>

<div id="outline-container-orgaea28bd" class="outline-4">
<h4 id="orgaea28bd"><span class="section-number-4">1.1.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
For now, you just need to know that <a href="20240120133450-overriding_a_method.html#ID-c67b24a4-82f7-4423-83a9-75fc1c566166">overriding a method</a> replaces the <code>parent</code> method on all reference variables (other than <code>super</code>), whereas hiding a method or <a href="20240120133531-hiding_variables.html#ID-a6c7507b-e399-48a8-a8af-7f29fd05eaad">variables</a> replaces the member only if a <code>child</code> reference type is used.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
